# Data Preprocessing

### Step 1:  Importing libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2: Importing dataset

In [57]:
dataset = pd.read_csv('datasets\Data.csv')
dataset

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

### Step 3: Handling the missing data

In [58]:
from sklearn.impute import SimpleImputer
num_cols=dataset.select_dtypes(include='number').columns
imputer=SimpleImputer()
imputed=imputer.fit_transform(dataset[num_cols])

In [59]:
orig_dataset=dataset
dataset[num_cols]=imputed
#dataset = dataset.iloc[:,:-1].values

In [60]:
dataset

   Country        Age        Salary Purchased
0   France  44.000000  72000.000000        No
1    Spain  27.000000  48000.000000       Yes
2  Germany  30.000000  54000.000000        No
3    Spain  38.000000  61000.000000        No
4  Germany  40.000000  63777.777778       Yes
5   France  35.000000  58000.000000       Yes
6    Spain  38.777778  52000.000000        No
7   France  48.000000  79000.000000       Yes
8  Germany  50.000000  83000.000000        No
9   France  37.000000  67000.000000       Yes

### Step 4: Encoding categorical data

In [53]:
#from sklearn import preprocessing
#labl=preprocessing.LabelEncoder()
#dataset['Country']=labl.fit_transform(dataset['Country'])

#### Creating a dummy variable

In [61]:
dataset = pd.get_dummies(dataset,drop_first=True )
dataset.columns

Index(['Age', 'Salary', 'Country_Germany', 'Country_Spain', 'Purchased_Yes'], dtype='object')

In [62]:
dataset

         Age        Salary  Country_Germany  Country_Spain  Purchased_Yes
0  44.000000  72000.000000                0              0              0
1  27.000000  48000.000000                0              1              1
2  30.000000  54000.000000                1              0              0
3  38.000000  61000.000000                0              1              0
4  40.000000  63777.777778                1              0              1
5  35.000000  58000.000000                0              0              1
6  38.777778  52000.000000                0              1              0
7  48.000000  79000.000000                0              0              1
8  50.000000  83000.000000                1              0              0
9  37.000000  67000.000000                0              0              1

### Step 5: Train and test dataset

In [65]:
from sklearn.model_selection import train_test_split
y_col=['Purchased_Yes']
y=dataset[y_col]
X=dataset.drop(columns=y_col)
X_train,X_test, y_train,y_test=train_test_split(X, y, test_size=0.3, random_state=1)

### Step 6: Feature Scaling

In [69]:
from sklearn import preprocessing
std_cols=['Age','Salary']
std_scl=preprocessing.StandardScaler()
X_train.loc[:,std_cols] = std_scl.fit_transform(X_train[std_cols])
X_test.loc[:,std_cols] = std_scl.fit_transform(X_test[std_cols])